### [데이터 필터링]
- 원하는 데이터를 추출하기 위해서 사용하는 방법
- 원하는 데이터 걸러내겠다는 의미
- 다양한 조건 검사 진행 => 비교 검사 : 같다 ==, 같지 않다 !=, 크다>, 크거나 같다 >=, 작다 <, 작거나 같다 <=
- 논리 연산자 : AND, OR, NOT

(1) 모듈 로딩

In [84]:
import datetime
import re

import pandas as pd
import numpy as np

(2) 데이터 준비

In [85]:
file = '../DATA/employees.csv'

(3)데이터 저장 및 확인

In [86]:
empdf = pd.read_csv(file)
empdf

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male     8/6/93       NaN   True     Marketing
1        Thomas    Male    3/31/96   61933.0   True           NaN
2         Maria  Female        NaN  130590.0  False       Finance
3         Jerry     NaN     3/4/05  138705.0   True       Finance
4         Larry    Male    1/24/98  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male    1/31/84   42392.0  False       Finance
997     Russell    Male    5/20/13   96914.0  False       Product
998       Larry    Male    4/20/13   60500.0  False  Business Dev
999      Albert    Male    5/15/12  129949.0   True         Sales
1000        NaN     NaN        NaN       NaN    NaN           NaN

[1001 rows x 6 columns]

(4) 데이터 다루기

(5) 데이터 필터링

In [87]:
'Happy' == 'Happy'

True

In [88]:
'Happy' != 'Happy'

False

- [문제] 데이터에서 이름이 Maria인 데이터만 추출

- bool 값으로 구성된 데이터 ==> 불린인덱싱(Boolean indexing)

In [89]:
empdf[empdf['First Name'] == 'Maria']

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

In [90]:
# gender 가 female 인 사람만 추출
empdf[empdf['Gender'] == 'Female']

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
6         Ruby  Female    8/17/87   65476.0   True       Product
7          NaN  Female    7/20/15   45906.0    NaN       Finance
8       Angela  Female   11/22/05   95570.0   True   Engineering
9      Frances  Female     8/8/02  139852.0   True  Business Dev
..         ...     ...        ...       ...    ...           ...
987     Gloria  Female    12/8/14  136709.0   True       Finance
988      Alice  Female    10/5/04   47638.0  False            HR
990      Robin  Female    7/24/87  100765.0   True            IT
991       Rose  Female    8/25/02  134505.0   True     Marketing
993       Tina  Female    5/15/97   56450.0   True   Engineering

[431 rows x 6 columns]

In [91]:
# 이름이 Maria 이고, gender 가 지정되지 않는 nan 인 사람만 추출
empdf[(empdf['First Name'] == 'Maria') & (empdf['Gender'].isnull())]

    First Name Gender Start Date    Salary   Mgmt   Team
815      Maria    NaN    1/18/86  106562.0  False     HR
844      Maria    NaN    6/19/85  148857.0  False  Legal

In [92]:
# empMariaMask 에 maria 가 first name 인지 여부 bool df 생성하기
empMariaMask = empdf['First Name'] == 'Maria'

# 이전에 선언한 조건을 활용하여 필터링 진행
empdf[empMariaMask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

In [93]:
# 이전에 선언한 조건과 Salary가 100000 이상인 사람 조회
empdf[(empMariaMask) & (empdf['Salary'] >= 100000)]

# 성별이 남성이고 급여가 100000 이상인 사람만 필터링
empdf[(empdf['Gender'] == 'Male') & (empdf['Salary'] >= 100000)]

# 성별이 여성이고 급여가 100000 이상인 사람만 필터
empdf[(empdf['Gender'] == 'Female') & (empdf['Salary'] >= 100000)]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
9      Frances  Female     8/8/02  139852.0   True  Business Dev
11       Julie  Female   10/26/97  102508.0   True         Legal
18       Diana  Female   10/23/81  132940.0  False            IT
30   Christina  Female     8/6/02  118780.0   True   Engineering
..         ...     ...        ...       ...    ...           ...
976     Denise  Female   10/19/92  137954.0   True         Legal
977      Sarah  Female    12/4/95  124566.0  False       Product
987     Gloria  Female    12/8/14  136709.0   True       Finance
990      Robin  Female    7/24/87  100765.0   True            IT
991       Rose  Female    8/25/02  134505.0   True     Marketing

[176 rows x 6 columns]

[문제]  employees 데이터에서 성별이 만자이며 연봉이 100000 이상인 데이터 조회

In [94]:
#[문제]  employees 데이터에서 성별이 만자이며 연봉이 100000 이상인 데이터 조회
empdf[(empdf['Gender'] == 'Male') & (empdf['Salary'] >= 100000)]

    First Name Gender Start Date    Salary   Mgmt         Team
4        Larry   Male    1/24/98  101004.0   True           IT
5       Dennis   Male    4/18/87  115163.0  False        Legal
12     Brandon   Male    12/1/80  112807.0   True           HR
13        Gary   Male    1/27/08  109831.0  False        Sales
17       Shawn   Male    12/7/86  111737.0  False      Product
..         ...    ...        ...       ...    ...          ...
979     Ernest   Male    7/20/13  142935.0   True      Product
981      James   Male    1/15/93  148985.0  False        Legal
983       John   Male   12/23/82  146907.0  False  Engineering
992    Anthony   Male   10/16/11  112769.0   True      Finance
999     Albert   Male    5/15/12  129949.0   True        Sales

[176 rows x 6 columns]

In [95]:
# Start Date를 datetime 형태로 타입 변환
empdf['Start Date'] = pd.to_datetime(empdf['Start Date'])


# Start Date 가 2000년도 이후이면서 Salary 가 80000 을 초과하는 사람 조회
empdf[(empdf['Start Date'].dt.year >= 2000) & (empdf['Salary'] > 80000)]

C:\Users\Administrator\AppData\Local\Temp\ipykernel_46536\510572758.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  empdf['Start Date'] = pd.to_datetime(empdf['Start Date'])

    First Name  Gender Start Date    Salary   Mgmt          Team
3        Jerry     NaN 2005-03-04  138705.0   True       Finance
8       Angela  Female 2005-11-22   95570.0   True   Engineering
9      Frances  Female 2002-08-08  139852.0   True  Business Dev
13        Gary    Male 2008-01-27  109831.0  False         Sales
16      Jeremy    Male 2010-09-21   90370.0  False            HR
..         ...     ...        ...       ...    ...           ...
992    Anthony    Male 2011-10-16  112769.0   True       Finance
994     George    Male 2013-06-21   98874.0   True     Marketing
995      Henry     NaN 2014-11-23  132483.0  False  Distribution
997    Russell    Male 2013-05-20   96914.0  False       Product
999     Albert    Male 2012-05-15  129949.0   True         Sales

[287 rows x 6 columns]

- 여러 개의 조건이 모두 True 이여야 하는 조건은 And
    * 문법 : 조건1 & 조건2 & 조건3
- 여러 개의 조건 중 하나라도 True 이면 조건을 만족하는 데이터 조회
    * 문법 : 조건1 | 조건2 | 조건3
- 만약 아님을 나타내고 싶을 때 조건 추가 방법
    * 문법 : ~조건

In [96]:
# 남성인 사람과 Salary 가 100000 이상인 사람 조건식을 마스크에 저장
empMaleMask = empdf['Gender'] == 'Male'
empHighSalaryMask = empdf['Salary'] >= 100000

# 여러 개의 조건이 모두 True 이여야 하는 조건은 And
empdf[empMaleMask & empHighSalaryMask]

    First Name Gender Start Date    Salary   Mgmt         Team
4        Larry   Male 1998-01-24  101004.0   True           IT
5       Dennis   Male 1987-04-18  115163.0  False        Legal
12     Brandon   Male 1980-12-01  112807.0   True           HR
13        Gary   Male 2008-01-27  109831.0  False        Sales
17       Shawn   Male 1986-12-07  111737.0  False      Product
..         ...    ...        ...       ...    ...          ...
979     Ernest   Male 2013-07-20  142935.0   True      Product
981      James   Male 1993-01-15  148985.0  False        Legal
983       John   Male 1982-12-23  146907.0  False  Engineering
992    Anthony   Male 2011-10-16  112769.0   True      Finance
999     Albert   Male 2012-05-15  129949.0   True        Sales

[176 rows x 6 columns]

In [97]:


# 여러 개의 조건 중 하나라도 True 이면 조건을 만족하는 데이터 조회
empdf[empMaleMask | empHighSalaryMask]

    First Name  Gender Start Date    Salary   Mgmt          Team
0      Douglas    Male 1993-08-06       NaN   True     Marketing
1       Thomas    Male 1996-03-31   61933.0   True           NaN
2        Maria  Female        NaT  130590.0  False       Finance
3        Jerry     NaN 2005-03-04  138705.0   True       Finance
4        Larry    Male 1998-01-24  101004.0   True            IT
..         ...     ...        ...       ...    ...           ...
995      Henry     NaN 2014-11-23  132483.0  False  Distribution
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[656 rows x 6 columns]

In [98]:
# 연봉이 가장 낮은 5명 조회
empdf.nsmallest(5, 'Salary')

    First Name  Gender Start Date   Salary   Mgmt     Team
576    Michael    Male 1993-07-30  35013.0  False  Product
238      Kevin    Male 1982-03-25  35061.0  False    Legal
82      Steven    Male 1980-03-30  35095.0   True       IT
63     Matthew    Male 2013-01-02  35203.0  False       HR
650    Cynthia  Female 1986-07-05  35381.0  False  Finance

In [99]:
# 연봉이 가장 높은 5명 조회
empdf.nlargest(5, 'Salary')

    First Name  Gender Start Date    Salary   Mgmt     Team
644  Katherine  Female 1996-08-13  149908.0  False  Finance
429       Rose  Female 2015-05-28  149903.0  False       HR
828    Cynthia  Female 2006-07-12  149684.0  False  Product
186        NaN  Female 2005-02-23  149654.0    NaN    Sales
160      Kathy  Female 2000-03-18  149563.0   True  Finance

- [문제] employees 데이터에서 입사일이 1993년 1월 1일 이전이거나 또는 Mgmt 가 False 이거나 NaN 인 사람 조회

In [100]:
# empdf 의 Mgmt의 데이터유형을 Bool 로 전환 이떄 NaN 인 경우 False 로 가정
empdf['Mgmt'] = empdf['Mgmt'].fillna(False)
empdf['Mgmt'] = empdf['Mgmt'].astype('bool')


# [문제] employees 데이터에서 입사일이 1993년 1월 1일 이전이지만 날짜 데이터가 있는 경우 또는 Mgmt 가 False 이
empdf[(empdf["Start Date"] <= pd.to_datetime('1993-01-01', format='%Y-%m-%d')) | (empdf['Mgmt']== False)]

C:\Users\Administrator\AppData\Local\Temp\ipykernel_46536\920631513.py:2: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  empdf['Mgmt'] = empdf['Mgmt'].fillna(False)

     First Name  Gender Start Date    Salary   Mgmt          Team
2         Maria  Female        NaT  130590.0  False       Finance
5        Dennis    Male 1987-04-18  115163.0  False         Legal
6          Ruby  Female 1987-08-17   65476.0   True       Product
7           NaN  Female 2015-07-20   45906.0  False       Finance
10       Louise  Female 1980-08-12   63241.0   True           NaN
...         ...     ...        ...       ...    ...           ...
995       Henry     NaN 2014-11-23  132483.0  False  Distribution
996     Phillip    Male 1984-01-31   42392.0  False       Finance
997     Russell    Male 2013-05-20   96914.0  False       Product
998       Larry    Male 2013-04-20   60500.0  False  Business Dev
1000        NaN     NaN        NaT       NaN  False           NaN

[679 rows x 6 columns]

In [101]:
# change Team dtype as category
empdf['Team'] = empdf['Team'].astype('category')
# change Gender dtype as category
empdf['Gender'] = empdf['Gender'].astype('category')
empdf

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male 1993-08-06       NaN   True     Marketing
1        Thomas    Male 1996-03-31   61933.0   True           NaN
2         Maria  Female        NaT  130590.0  False       Finance
3         Jerry     NaN 2005-03-04  138705.0   True       Finance
4         Larry    Male 1998-01-24  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male 1984-01-31   42392.0  False       Finance
997     Russell    Male 2013-05-20   96914.0  False       Product
998       Larry    Male 2013-04-20   60500.0  False  Business Dev
999      Albert    Male 2012-05-15  129949.0   True         Sales
1000        NaN     NaN        NaT       NaN  False           NaN

[1001 rows x 6 columns]

In [102]:
# show the people who doesn't have Start Date in empdf
empdf[empdf['Start Date'].isnull()]

     First Name  Gender Start Date    Salary   Mgmt     Team
2         Maria  Female        NaT  130590.0  False  Finance
1000        NaN     NaN        NaT       NaN  False      NaN

Equality
employees["Team"] == "Marketing"
employees["Team"].eq("Marketing")
Inequality
employees["Team"] != "Marketing"
employees["Team"].ne("Marketing")
Less than
employees["Salary"] < 100000
employees["Salary"].lt(100000)
Less than or
equal to
employees["Salary"] <= 100000
employees["Salary"].le(100000)
Greater than
employees["Salary"] > 100000
employees["Salary"].gt(100000)
Greater than
or equal to
employees["Salary"] >= 100000
employees["Salary"].ge(100000)

In [105]:
# get 'IT' 'Legal' Team people by using isin
empdf[empdf['Team'].isin(['IT', 'Legal','Product'])]

    First Name  Gender Start Date    Salary   Mgmt     Team
4        Larry    Male 1998-01-24  101004.0   True       IT
5       Dennis    Male 1987-04-18  115163.0  False    Legal
6         Ruby  Female 1987-08-17   65476.0   True  Product
11       Julie  Female 1997-10-26  102508.0   True    Legal
15     Lillian  Female 2016-06-05   59414.0  False  Product
..         ...     ...        ...       ...    ...      ...
981      James    Male 1993-01-15  148985.0  False    Legal
985    Stephen     NaN 1983-07-10   85668.0  False    Legal
989     Justin     NaN 1991-02-10   38344.0  False    Legal
990      Robin  Female 1987-07-24  100765.0   True       IT
997    Russell    Male 2013-05-20   96914.0  False  Product

[289 rows x 6 columns]

In [107]:
# get people who's salary is in between 50000 and 70000 using between pd method
# 이떄 둘 다 포함함 both
empdf[empdf['Salary'].between(50000, 70000)]

    First Name  Gender Start Date   Salary   Mgmt          Team
1       Thomas    Male 1996-03-31  61933.0   True           NaN
6         Ruby  Female 1987-08-17  65476.0   True       Product
10      Louise  Female 1980-08-12  63241.0   True           NaN
15     Lillian  Female 2016-06-05  59414.0  False       Product
20        Lois     NaN 1995-04-22  64714.0   True         Legal
..         ...     ...        ...      ...    ...           ...
970      Alice  Female 1988-09-03  63571.0   True       Product
974      Harry    Male 2011-08-30  67656.0   True            IT
978       Sean    Male 1983-01-17  66146.0  False            HR
993       Tina  Female 1997-05-15  56450.0   True   Engineering
998      Larry    Male 2013-04-20  60500.0  False  Business Dev

[173 rows x 6 columns]

- 구간 지정 검사 불린 메서드 => df.between(low, high, inclusive='neither')
- Literal["both", "neither", "left", "right"]

In [109]:
# get people who's salary is in between 80000 and 90000 using between method
empdf[empdf['Salary'].between(80000, 90000, inclusive='neither')]


# express above as althmetric method
empdf[(empdf['Salary'] > 80000) & (empdf['Salary'] < 90000)]

    First Name  Gender Start Date   Salary   Mgmt         Team
19       Donna  Female 2010-07-22  81014.0  False      Product
31       Joyce     NaN 2005-02-20  88657.0  False      Product
35     Theresa  Female 2006-10-10  85182.0  False        Sales
45       Roger    Male 1980-04-17  88010.0   True        Sales
54        Sara  Female 2007-08-15  83677.0  False  Engineering
..         ...     ...        ...      ...    ...          ...
930      Nancy  Female 2001-09-10  85213.0   True    Marketing
956    Beverly  Female 1986-10-17  80838.0  False  Engineering
963        Ann  Female 1994-09-23  89443.0   True        Sales
985    Stephen     NaN 1983-07-10  85668.0  False        Legal
986      Donna  Female 1982-11-26  82871.0  False    Marketing

[94 rows x 6 columns]

In [110]:
# get person who get the highest salary in sales team
empdf[empdf['Team'] == 'Sales'].nlargest(1, 'Salary')

    First Name  Gender Start Date    Salary   Mgmt   Team
186        NaN  Female 2005-02-23  149654.0  False  Sales

In [112]:
# make first name upper case
# 문자열일 경우 str 내용에 대한 접근 방법
empdf['First Name'].str.upper()

0       DOUGLAS
1        THOMAS
2         MARIA
3         JERRY
4         LARRY
         ...
996     PHILLIP
997     RUSSELL
998       LARRY
999      ALBERT
1000        NaN
Name: First Name, Length: 1001, dtype: object

In [113]:
# get people who's Gender is Male
empdf[empdf['Gender'] == 'Male']

    First Name Gender Start Date    Salary   Mgmt          Team
0      Douglas   Male 1993-08-06       NaN   True     Marketing
1       Thomas   Male 1996-03-31   61933.0   True           NaN
3        Jerry    NaN 2005-03-04  138705.0   True       Finance
4        Larry   Male 1998-01-24  101004.0   True            IT
5       Dennis   Male 1987-04-18  115163.0  False         Legal
..         ...    ...        ...       ...    ...           ...
995      Henry    NaN 2014-11-23  132483.0  False  Distribution
996    Phillip   Male 1984-01-31   42392.0  False       Finance
997    Russell   Male 2013-05-20   96914.0  False       Product
998      Larry   Male 2013-04-20   60500.0  False  Business Dev
999     Albert   Male 2012-05-15  129949.0   True         Sales

[999 rows x 6 columns]

In [115]:
# get the person who's Salary is the highest in Gender Male
empdf[(empdf['Gender'] == 'Male')].nlargest(1, 'Salary')

    First Name Gender Start Date    Salary   Mgmt   Team
981      James   Male 1993-01-15  148985.0  False  Legal

In [116]:
# get the person who's Salary is the highest in Team IT
empdf[(empdf['Team'] == 'IT')].nlargest(1, 'Salary')

    First Name  Gender Start Date    Salary  Mgmt Team
287       Lois  Female 2011-11-09  147183.0  True   IT